ok2haz/Frequency_Counter_FPGA/Frequency_Counter_STM32H757/CM7/Core/Src/datalog.c
static int16_t sens_c100(sensor_id_t id)
{
    const sensor_stat_t *s = &g_sensors[id];
    if (!s->valid || s->samples == 0) return DATALOG_INVALID16;
    float v = s->last * 100.0f;
    if (v > 32000.0f || v < -32000.0f) return DATALOG_INVALID16;
    return (int16_t)(v < 0 ? v - 0.5f : v + 0.5f);
}

static int16_t sens_mv(sensor_id_t id)
{
    const sensor_stat_t *s = &g_sensors[id];
    if (!s->valid || s->samples == 0) return DATALOG_INVALID16;
    float v = s->last;
    if (v > 32000.0f || v < -32000.0f) return DATALOG_INVALID16;
    return (int16_t)(v + 0.5f);
}

static void sample(datalog_rec_t *r)
{
    memset(r, 0, sizeof *r);

    fpga_meas_t m;
    int use16 = 0;
    if (fpga_freq_get_last(&m)) {
        /* fpga_freq_select() ma vnitrni stav a smi ji volat JEN FpgaTask ->
         * tady jen precteme, ktera odbocka ma platna data (bez hystereze). */
        use16 = (m.error_flags & FPGA_ERR_MEAS) && !(m.status2 & FPGA_ST2_DIV16_ERR);
        r->freq_x100000 = use16 ? m.freq16_x100000 : m.frequency_x100000;
    }

    r->t_unix       = g_rtc_synced ? datalog_text_to_unix((const char *)g_rtc_text) : 0u;
    r->t_ocxo_c100  = sens_c100(SENS_T49);    /* OCXO */
    r->t_board_c100 = sens_c100(SENS_T48);    /* STM deska */
    r->ocxo_vc_mv   = sens_mv(SENS_ADS0);     /* ladici napeti */
    /* RF: ADS AIN1 je mV z AD8307; prevod na dBm dela UI (kalibrace g_calib).
     * Do logu jde SYROVE mV — kalibrace se muze zmenit, syrova hodnota ne. */
    r->rf_mv     = sens_mv(SENS_ADS1);
    r->vbat_mv      = sens_mv(SENS_VBAT);     /* zalozni CR2032 — trend stárnutí */

    gps_data_t g;
    gps_get(&g);
    uint8_t f = 0;
    if (g.valid)                                f |= DATALOG_F_GPS_VALID;
    if (g.fix_mode >= 3)                        f |= DATALOG_F_FIX_3D;
    if (g_spi_ok)                               f |= DATALOG_F_FPGA_LINK;
    if (g_freq_stale)                           f |= DATALOG_F_SIGNAL_LOST;
    if (use16)                                  f |= DATALOG_F_DIV16;
    if (!g.valid && g.fixes > 0)                f |= DATALOG_F_HOLDOVER;
    if (fpga_sim_active())                      f |= DATALOG_F_SIM;   /* emulovany kmitocet */
    r->flags  = f;
    r->sats   = g.num_sat;
    r->hdop10 = (g.hdop > 0.0f && g.hdop < 25.0f) ? (uint8_t)(g.hdop * 10.0f + 0.5f) : 255u;
}

/* Zapise zaznam na s_head (vc. erase na hranici bloku). Ocekava drzeny mutex. */
static bool write_rec(const datalog_rec_t *r)
{
    if (s_be->erase_size && (s_head % s_be->erase_size) == 0) {
        /* Novy blok -> smazat (zahodi 128 nejstarsich zaznamu = kruh). */
        if (s_be->erase == NULL || !s_be->erase(s_head)) return false;
        if (s_head == 0 && s_seq != 0) s_wrapped = true;   /* obeh dokola */
    }
    uint8_t b[DATALOG_REC_SIZE];
    pack_rec(b, r);
    if (!s_be->write(s_head, b, DATALOG_REC_SIZE)) return false;

    s_head = (s_head + DATALOG_REC_SIZE) % s_be->capacity;
    s_seq  = r->seq;
    uint32_t cap_rec = s_be->capacity / DATALOG_REC_SIZE;
    if (s_count < cap_rec) s_count++;
    return true;
}

void datalog_tick(void)
{
    if (!s_ready || !s_enabled) return;
    if ((int32_t)(HAL_GetTick() - s_next_ms) < 0) return;
    s_next_ms += DATALOG_PERIOD_S * 1000u;

    datalog_rec_t r;
    sample(&r);
    r.seq = s_seq + 1u;

    /* Kratky timeout: pri obsazene flash (calib_save / syscfg / UART qspitest)
     * vzorek zahodime a jedeme dal — defaultTask nesmi zdrzet watchdog. */
    if (osMutexAcquire(qspiMutexHandle, DL_LOCK_TICK_MS) != osOK) { s_errors++; return; }
    bool ok = write_rec(&r);
    osMutexRelease(qspiMutexHandle);
    if (!ok) s_errors++;
}

void datalog_set_enabled(bool en) { s_enabled = en; }
bool datalog_enabled(void)         { return s_enabled; }

void datalog_get_status(datalog_status_t *out)
{
    if (out == NULL) return;
    out->backend      = s_ready ? s_be->name : "--";
    out->ready        = s_ready;
    out->enabled      = s_enabled;
    out->records      = s_count;
    out->capacity_rec = s_ready ? s_be->capacity / DATALOG_REC_SIZE : 0u;
    out->last_seq     = s_seq;
    out->write_errors = s_errors;
    out->wrapped      = s_wrapped;
}

bool datalog_read_back(uint32_t from_newest, datalog_rec_t *out)
{
    if (!s_ready || out == NULL || from_newest >= s_count) return false;
    /* s_head ukazuje ZA posledni zapsany -> zpet o (from_newest+1) zaznamu. */
    uint32_t back = (from_newest + 1u) * DATALOG_REC_SIZE;
    uint32_t off  = (s_head + s_be->capacity - (back % s_be->capacity)) % s_be->capacity;

    uint8_t b[DATALOG_REC_SIZE];
    if (osMutexAcquire(qspiMutexHandle, DL_LOCK_READ_MS) != osOK) return false;
    bool ok = s_be->read(off, b, DATALOG_REC_SIZE);
    osMutexRelease(qspiMutexHandle);
    return ok && unpack_rec(b, out);
}

void datalog_format_status(char *buf, int buflen)
{
    if (buf == NULL || buflen <= 0) return;
    if (!s_ready) { snprintf(buf, (size_t)buflen, "DATALOG NEDOSTUPNE (uloziste)"); return; }
    snprintf(buf, (size_t)buflen, "DATALOG %s %s %lu/%lu rec seq:%lu err:%lu%s",
             s_be->name, s_enabled ? "ON" : "OFF",
             (unsigned long)s_count, (unsigned long)(s_be->capacity / DATALOG_REC_SIZE),
             (unsigned long)s_seq, (unsigned long)s_errors, s_wrapped ? " WRAP" : "");
}

bool datalog_erase_all(void)
{
    if (!s_ready) return false;
    if (osMutexAcquire(qspiMutexHandle, DL_LOCK_ERASE_MS) != osOK) return false;
    bool ok = true;
    if (s_be->erase_size && s_be->erase) {
        for (uint32_t off = 0; off < s_be->capacity; off += s_be->erase_size) {
            if (!s_be->erase(off)) { ok = false; break; }
        }
    }
    if (ok) { s_head = 0; s_seq = 0; s_count = 0; s_wrapped = false; s_errors = 0; }
    osMutexRelease(qspiMutexHandle);
    return ok;
}

volatile uint8_t g_datalog_erase_req  = 0;
volatile uint8_t g_datalog_erase_busy = 0;

void datalog_erase_service(void)
{
    if (!g_datalog_erase_req) return;
    /* ⚠️ `g_datalog_erase_req` se NULUJE AZ PO dokonceni (ne pred zacatkem).
     * Erase celeho regionu trva az minuty a UI po tu dobu vidi priznak porad
     * nastaveny -> jeho `if (!g_datalog_erase_req)` guard funguje jako dedup a
     * druhe projiti potvrzovaci sekvenci uz dalsi (zbytecny) erase nezaradi.
     * Kdyby se priznak shodil hned, slo by behem jednoho mazani zaradit dalsi. */
    g_datalog_erase_busy = 1;    /* UI to ukaze v radku Stav — jinak vypada zaseknute */
    printf("DATALOG: mazu cely log (z UI), cekej...\n");
    printf("DATALOG: erase %s\n", datalog_erase_all() ? "OK" : "FAIL");
    g_datalog_erase_busy = 0;
    g_datalog_erase_req  = 0;
}

/* ── Selftest (pure logic, bez HW — soucast UART "selftest") ───────────────── */
bool datalog_selftest(void)
{
    /* 1) round-trip serializace vcetne zapornych teplot a plneho u64 kmitoctu */
    datalog_rec_t a = {
        .seq = 0x01020304u, .t_unix = 1782000000u,
        .freq_x100000 = 1000000012345ull,
        .t_ocxo_c100 = -1234, .t_board_c100 = 4567,
        .ocxo_vc_mv = 2500, .rf_mv = -455,
        .flags = DATALOG_F_GPS_VALID | DATALOG_F_DIV16, .sats = 9, .hdop10 = 12,
        .vbat_mv = 2920,
    };
    uint8_t b[DATALOG_REC_SIZE];
    datalog_rec_t r;
    pack_rec(b, &a);
    if (!unpack_rec(b, &r)) return false;
    if (r.seq != a.seq || r.t_unix != a.t_unix || r.freq_x100000 != a.freq_x100000) return false;
    if (r.t_ocxo_c100 != a.t_ocxo_c100 || r.t_board_c100 != a.t_board_c100) return false;
    if (r.ocxo_vc_mv != a.ocxo_vc_mv || r.rf_mv != a.rf_mv) return false;
    if (r.flags != a.flags || r.sats != a.sats || r.hdop10 != a.hdop10) return false;
    /* VBAT je kvantovany na 8 mV, takze round-trip NENI presny — 2920 sedne
     * na 2920 (2920-2000=920, 920/8=115 -> 2000+115*8), ale obecne se testuje
     * jen to, ze se hodnota vejde do kroku. */
    if (r.vbat_mv < a.vbat_mv - DATALOG_VBAT_STEP_MV ||
        r.vbat_mv > a.vbat_mv + DATALOG_VBAT_STEP_MV) return false;
    /* ⚠️ Zpetna kompatibilita: STARY zaznam ma bajt 27 = 0 a MUSI se precist jako
     * "nezaznamenano", ne jako mrtva baterie 2,00 V. Sestavime takovy zaznam
     * rucne (vcetne prepocteneho CRC) a overime. */
    {   uint8_t old[DATALOG_REC_SIZE];
        datalog_rec_t o;
        pack_rec(old, &a);
        old[27] = 0u;                       /* jako by ho zapsal firmware pred 2026-08-17 */
        put_u16(old + 28, crc16(old, 28));  /* CRC bajt 27 pokryva -> prepocitat */
        if (!unpack_rec(old, &o)) return false;
        if (o.vbat_mv != DATALOG_INVALID16) return false;
    }
    /* Neplatne cteni senzoru se ulozi jako "nezaznamenano". */
    {   datalog_rec_t n = a; n.vbat_mv = DATALOG_INVALID16;
        uint8_t nb[DATALOG_REC_SIZE]; datalog_rec_t nr;
        pack_rec(nb, &n);
        if (nb[27] != DATALOG_VBAT_NONE) return false;
        if (!unpack_rec(nb, &nr) || nr.vbat_mv != DATALOG_INVALID16) return false;
    }

    /* 2) poskozeny bajt musi CRC odhalit */
    b[10] ^= 0xFFu;
    if (unpack_rec(b, &r)) return false;

    /* 3) prazdny (smazana flash) slot neni zaznam */
    memset(b, 0xFF, sizeof b);
    if (unpack_rec(b, &r)) return false;

    /* 4) kalendar -> unix (vektory: epocha, prestupny rok, znamy datum) */
    if (datalog_text_to_unix("1970-01-01 00:00:00") != 0u) return false;
    if (datalog_text_to_unix("2000-03-01 00:00:00") != 951868800u) return false;
    if (datalog_text_to_unix("2026-07-20 12:34:56") != 1784550896u) return false;
    if (datalog_text_to_unix("nesmysl") != 0u) return false;

    /* 5) SD backend: 512B read-modify-write layer (SD zatím neaktivní, jen logika) */
    if (!datalog_sd_selftest()) return false;
    return true;
}
